import style from "./team-info.module.css";

export const TeamInfo = () => {
    return (
        <div className={style.TeamInfoWrapper}>
            <p>Наша команда junior-web-разработчиков состоит из четырех учеников курсов, которые уже успели познакомиться с основами веб-разработки и успешно прошли несколько хакатонов. Мы работаем сообща над различными проектами, обмениваемся опытом и помогаем друг другу в решении сложных задач. В нашей команде есть те, кто отлично разбирается во фронтенде, те, кто знает все о бэкенде, а также специалисты по дизайну и тестированию. Мы стремимся к постоянному развитию, изучая новые технологии и подходы в веб-разработке, чтобы стать настоящими профессионалами в своей области.</p>
        </div>
    )
}