export const questionsForReact = [
  {
    id: "001",
    question: "Что такое React?",
    options: [
      { id: "01", text: "Язык программирования" },
      {
        id: "02",
        text: "Библиотека для создания пользовательских интерфейсов",
      },
      { id: "03", text: "Среда разработки" },
    ],
    answer: "02",
  },
  {
    id: "002",
    question: "Как создать компонент в React?",
    options: [
      { id: "01", text: "С помощью функции или класса" },
      { id: "02", text: "Только с помощью класса" },
      { id: "03", text: "Только с помощью функции" },
    ],
    answer: "01",
  },
  {
    id: "003",
    question: "Что такое JSX?",
    options: [
      { id: "01", text: "Формат данных" },
      { id: "02", text: "Язык разметки" },
      { id: "03", text: "Расширение языка JavaScript, используемое в React" },
    ],
    answer: "03",
  },
  {
    id: "004",
    question: "Как передать данные между компонентами в React?",
    options: [
      { id: "01", text: "Через props" },
      { id: "02", text: "Через state" },
      { id: "03", text: "Через ref" },
    ],
    answer: "01",
  },
  {
    id: "005",
    question: "Что такое жизненный цикл компонента в React?",
    options: [
      {
        id: "01",
        text: "Период времени, в течение которого компонент активен",
      },
      { id: "02", text: "Способ, которым компонент рендерится и обновляется" },
      { id: "03", text: "События, происходящие внутри компонента" },
    ],
    answer: "02",
  },
  {
    id: "006",
    question:
      "Какое ключевое слово используется для создания асинхронных функций в React?",
    options: [
      { id: "01", text: "create" },
      { id: "02", text: "await" },
      { id: "03", text: "async" },
    ],
    answer: "03",
  },
  {
    id: "007",
    question: "Что такое setState в React?",
    options: [
      { id: "01", text: "Метод для создания новых элементов" },
      { id: "02", text: "Метод для обновления состояния компонента" },
      { id: "03", text: "Функция для создания комментариев" },
    ],
    answer: "02",
  },
  {
    id: "008",
    question: "Что такое useEffect в React",
    options: [
      { id: "01", text: "Функция для создания комментариев" },
      { id: "02", text: "Метод для создания новых элементов" },
      {
        id: "03",
        text: "Хук для управления эффектами и жизненным циклом компонента",
      },
    ],
    answer: "03",
  },
  {
    id: "009",
    question:
      "Какое ключевое слово используется для создания компонентов в React?",
    options: [
      {
        id: "01",
        text: "Оба варианта правильные",
      },
      { id: "02", text: "function" },
      { id: "03", text: "class" },
    ],
    answer: "01",
  },
  {
    id: "010",
    question: "Что такое state в React?",
    options: [
      {
        id: "01",
        text: "Метод для создания новых элементов",
      },
      { id: "02", text: "Состояние компонента, которое может изменяться" },
      { id: "03", text: "Функция для создания комментариев" },
    ],
    answer: "02",
  },
];
